#include<stdio.h>

int main(void)
{

	int ary1[4][3] = {
		{46, 79, 78},
		{35, 57, 28},
		{43, 68, 76},
		{56, 78, 98}
	};
	int ary2[4][3] = {
		{78, 35, 99},
		{85, 82, 34},
		{58, 69, 29},
		{34, 59, 35}
	};

	
		
	printf("위의 두 행렬 합의 결과값입니다.\n");
	printf("--------------------------\n");
	// 행렬 합
	for (int i = 0; i < 4; i++) {
		for (int j = 0; j < 3; j++) {
			printf("|  %4d", ary1[i][j] + ary2[i][j]);
		}
		printf("|\n");
	}
	printf("--------------------------\n\n");

	printf("위의 두 행렬 차의 결과값입니다.\n");
	printf("--------------------------\n");
	//행렬 차
	for (int i = 0; i < 4; i++) {
		for (int j = 0; j < 3; j++) {
			printf("|  %4d", ary1[i][j] - ary2[i][j]);
		}
		printf("|\n");
	}
	printf("--------------------------\n");


}